       01 ADDRESS-FIELDS.
          05 ADDR-LINE1          PIC X(30).
          05 ADDR-LINE2          PIC X(30).
          05 ADDR-CITY           PIC X(20).
          05 ADDR-COUNTRY        PIC X(20).
          05 ADDR-ZIP            PIC X(10).
