       01 ERROR-RECORD-FIELDS.
          05 ERR-CODE              PIC XX.
          05 ERR-MESSAGE           PIC X(60).
          05 ERR-PROGRAM           PIC X(8).
          05 ERR-LINE-NO            PIC 9(4).
